{
  "content": {
    "https://github.com/ai-forever/mgpt": [
      "mGPT",
      "Multilingual Generative Pretrained Transformer",
      "mGPT Multilingual Generative Pretrained Transformer",
      "mGPT Multilingual Generative Pretrained Transformer "
    ],
    "https://deepai.org/machine-learning-model/torch-srgan": [
      "Super Resolution",
      "The Super Resolution API uses machine learning to clarify, sharpen, and upscale the photo without losing its content and defining characteristics. Blurry images are unfortunately common and are a problem for professionals and hobbyists alike. Super resolution uses machine learning techniques to upscale images in a fraction of a second.",
      "Super Resolution The Super Resolution API uses machine learning to clarify, sharpen, and upscale the photo without losing its content and defining characteristics. Blurry images are unfortunately common and are a problem for professionals and hobbyists alike. Super resolution uses machine learning techniques to upscale images in a fraction of a second."
    ],
    "https://deepai.org/chat": [
      "AI Chat",
      "AI Chat is an AI chatbot that writes text. You can use it to write stories, messages, or programming code.",
      "AI Chat AI Chat is an AI chatbot that writes text. You can use it to write stories, messages, or programming code."
    ],
    "https://deepai.org/machine-learning-model/text2img": [
      "AI Image Generator",
      "This is an AI Image Generator. It creates an image from scratch from a text description.",
      "AI Image Generator This is an AI Image Generator. It creates an image from scratch from a text description."
    ],
    "https://deepai.org/video": [
      "AI Video Generator",
      "This AI video generator converts text to video, or image to video. Use it to convert images to animations. Or, Create videos from scratch from text!",
      "AI Video Generator This AI video generator converts text to video, or image to video. Use it to convert images to animations. Or, Create videos from scratch from text!"
    ],
    "https://deepai.org/machine-learning-model/image-editor": [
      "AI Photo Editor",
      "Edit photos and images with AI.",
      "AI Photo Editor Edit photos and images with AI."
    ],
    "https://deepai.org/voice": [
      "Voice Chat",
      "Voice Chat by Deep AI. Chat with AI using your voice. The most advanced AI voice chat mode.",
      "Voice Chat Voice Chat by Deep AI. Chat with AI using your voice. The most advanced AI voice chat mode."
    ],
    "https://www.viinyx.com": [
      "Generate any text and imageThe most useful all-in-one AI assistantPowered by ChatGPT, GPT-4o, o3, Gemini 2, Claude 3.5+, DeepSeek, DALL·E 3,FLUX, and many more."
    ],
    "https://www.saashub.com/about": [
      "SaaSHub",
      "SaaSHub is your independent software marketplace. Our goal is to help",
      "end users find the best software and product alternatives while helping",
      "software vendors improve their online presence and promote their software.",
      "What do you mean by independent?",
      "We will always use the same logic to prepare our main lists of alternatives.",
      "We may highlight featured products, but we never move products up the ranking list",
      "just because they are featured. While some products might be listed as recommended",
      "on the sidebar, the main lists are entirely based on objective criteria.",
      "How does SaaSHub work?",
      "We collect articles containing",
      "product reviews, alternatives to a particular product or lists",
      "with the best software available in a specific category. Then, based on our",
      "algorithms and user votes, we compile lists with the best alternatives.",
      "Product Verification",
      "The process of product verification is one of the cornerstones of SaaSHub.",
      "On one side, it ensures that end-users see only up-to-date and verified information.",
      "For example, current pricing, description, logos, etc. of products.",
      "On the other side, it gives software vendors the control over their listing in",
      "our marketplace.",
      "Learn more →",
      "Once a product is verified, a vendor's representative is going to receive a",
      "quarterly notification with a one-click option to verify their listing. That will",
      "help us keep all the information up to date.",
      "More...",
      "As a Startup, SaaSHub is under constant development. We are continuously working",
      "towards improving it, keeping it simple, making it more helpful and providing objective lists.",
      "Should you have any feedback or ideas for improvement, please, do not hesitate",
      "to drop us a line through the \"Feedback\" button in the bottom right corner.",
      "We may use affiliate or promotional links for some products that we recommend or that we partner with.",
      "We may receive compensation from companies for promoting their products through our website. Only approved",
      "products can be promoted on SaaSHub. This helps us to keep improving and supporting the platform.",
      "SaaSHub  SaaSHub is your independent software marketplace. Our goal is to help end users find the best software and product alternatives while helping software vendors improve their online presence and promote their software.  What do you mean by independent?  We will always use the same logic to prepare our main lists of alternatives. We may highlight featured products, but we never move products up the ranking list just because they are featured. While some products might be listed as recommended on the sidebar, the main lists are entirely based on objective criteria.  How does SaaSHub work?  We collect articles containing product reviews, alternatives to a particular product or lists with the best software available in a specific category. Then, based on our algorithms and user votes, we compile lists with the best alternatives.  Product Verification  The process of product verification is one of the cornerstones of SaaSHub. On one side, it ensures that end-users see only up-to-date and verified information. For example, current pricing, description, logos, etc. of products. On the other side, it gives software vendors the control over their listing in our marketplace. Learn more →   Once a product is verified, a vendor's representative is going to receive a quarterly notification with a one-click option to verify their listing. That will help us keep all the information up to date.  More...  As a Startup, SaaSHub is under constant development. We are continuously working towards improving it, keeping it simple, making it more helpful and providing objective lists.   Should you have any feedback or ideas for improvement, please, do not hesitate to drop us a line through the \"Feedback\" button in the bottom right corner.   We may use affiliate or promotional links for some products that we recommend or that we partner with. We may receive compensation from companies for promoting their products through our website. Only approved products can be promoted on SaaSHub. This helps us to keep improving and supporting the platform."
    ],
    "https://women-in-ai-ireland.github.io/August-2020-WaiLEARN-QA-Chatbot": [
      "This project describes a QA Chatbot built using the Facebook Babi Dataset.",
      "What is a Chatbot?",
      "A Chatbot is a computer program that facilitates technological and human communication through various input methods, such as text, voice and gesture. Chatbots serve the purpose of  digital assistants, virtual assistants, AI assistants and much more. The recent technological advancement like Natural Language Processing(NLP), Artificial Intelligence(AI), Data Mining and Machine Learning(ML) have resulted in the creation of advanced AI Chatbots that are useful to businesses and individuals alike.",
      "Chatbot Functionality",
      "Chatbot is used by enterprises to communicate within their business, with customers regarding the services rendered and so on. The Chatbot understands text by using Natural Language Processing (NLP). Natural Language Understanding (NLU) is used by chatbots to understand the language, which is combined with algorithms to give a suitable response to the supplied query. The next level in the delivery of the natural and personalized experience is achieved by Natural Language Generation (NLG).",
      "Types of Technology for Chatbots",
      "The technology driving today’s chatbot is linguistics and machine learning. The linguistic chatbots are also known as rule based chatbots and are structured in a way that responses to queries are done in meaningful ways. These chatbots are basic and close to interactive questioning. Machine learning (AI chatbots) are complex chatbots which are data driven and use NLU to personalize answers.",
      "How are chatbots trained?",
      "To train AI bots, it is paramount that a huge amount of training data is fed into the system to get sophisticated services. A hybrid approach is the best solution to enterprises looking for complex chatbots. The queries which cannot be answered by AI bots can be taken care of by linguistic chatbots. The data resulting from these basic bots can then be further applied to train AI bots, resulting in the hybrid bot system.",
      "The Facebook bAbI dataset",
      "The bAbI project was conducted by Facebook AI research team in 2015 to solve the problem of automatic text understanding and reasoning in an intelligent dialogue agent. To make the conversation with the interface as human as possible the team developed proxy tasks that evaluate reading comprehension via question answering.",
      "The tasks are designed to measure directly how well language models can exploit wider linguistic context. For our project, the subset of Babi Data Set from Facebook Research is used. Read more about bAbi here.",
      "We will be developing a simple chatbot that can answer questions based on a “story” given to it. So without any further ado let’s get started!",
      "Step 1: Import required libraries and read the data files.",
      "Python pickle module is used for serializing and de-serializing a Python object structure. ",
      "The numpy library is used to work with arrays. We will unpickle train and test data.",
      "This project describes a QA Chatbot built using the Facebook Babi Dataset. What is a Chatbot? A Chatbot is a computer program that facilitates technological and human communication through various input methods, such as text, voice and gesture. Chatbots serve the purpose of  digital assistants, virtual assistants, AI assistants and much more. The recent technological advancement like Natural Language Processing(NLP), Artificial Intelligence(AI), Data Mining and Machine Learning(ML) have resulted in the creation of advanced AI Chatbots that are useful to businesses and individuals alike. Chatbot Functionality Chatbot is used by enterprises to communicate within their business, with customers regarding the services rendered and so on. The Chatbot understands text by using Natural Language Processing (NLP). Natural Language Understanding (NLU) is used by chatbots to understand the language, which is combined with algorithms to give a suitable response to the supplied query. The next level in the delivery of the natural and personalized experience is achieved by Natural Language Generation (NLG). Types of Technology for Chatbots The technology driving today’s chatbot is linguistics and machine learning. The linguistic chatbots are also known as rule based chatbots and are structured in a way that responses to queries are done in meaningful ways. These chatbots are basic and close to interactive questioning. Machine learning (AI chatbots) are complex chatbots which are data driven and use NLU to personalize answers. How are chatbots trained? To train AI bots, it is paramount that a huge amount of training data is fed into the system to get sophisticated services. A hybrid approach is the best solution to enterprises looking for complex chatbots. The queries which cannot be answered by AI bots can be taken care of by linguistic chatbots. The data resulting from these basic bots can then be further applied to train AI bots, resulting in the hybrid bot system. The Facebook bAbI dataset The bAbI project was conducted by Facebook AI research team in 2015 to solve the problem of automatic text understanding and reasoning in an intelligent dialogue agent. To make the conversation with the interface as human as possible the team developed proxy tasks that evaluate reading comprehension via question answering. The tasks are designed to measure directly how well language models can exploit wider linguistic context. For our project, the subset of Babi Data Set from Facebook Research is used. Read more about bAbi here. We will be developing a simple chatbot that can answer questions based on a “story” given to it. So without any further ado let’s get started! Step 1: Import required libraries and read the data files. Python pickle module is used for serializing and de-serializing a Python object structure.  The numpy library is used to work with arrays. We will unpickle train and test data.",
      "Step 4: Vectorizing the data",
      "We would be using Keras library for processing this vocab. Keras is an open source neural network library written in Python. It could run on top of TensorFlow, Theano, Microsoft Cognitive Toolkit, R. TensorFlow is a machine learning tool which is designed for deep neural network models. Pad_sequences in Keras  is used to ensure that all sequences in a list have the same length. By default this is done by padding 0 in the beginning of each sequence until each sequence has the same length as the longest sequence. Keras provides the Tokenizer class for preparing text documents. The Tokenzier is constructed and is fit on the text documents using fit_on_texts . After the fit, Tokenzier allows us to use word_index (A dictionary of words and their uniquely assigned integers) on the documents. Each token(word) in the story is assigned an integer. We can then check the length of training data story text and length of story sequence.",
      "Step 4: Vectorizing the data We would be using Keras library for processing this vocab. Keras is an open source neural network library written in Python. It could run on top of TensorFlow, Theano, Microsoft Cognitive Toolkit, R. TensorFlow is a machine learning tool which is designed for deep neural network models. Pad_sequences in Keras  is used to ensure that all sequences in a list have the same length. By default this is done by padding 0 in the beginning of each sequence until each sequence has the same length as the longest sequence. Keras provides the Tokenizer class for preparing text documents. The Tokenzier is constructed and is fit on the text documents using fit_on_texts . After the fit, Tokenzier allows us to use word_index (A dictionary of words and their uniquely assigned integers) on the documents. Each token(word) in the story is assigned an integer. We can then check the length of training data story text and length of story sequence.",
      "This function will take input data that contains stories, queries and answers, a word_index which is a dictionary of words and assigns integers, maximum length of story and longest question as parameters.",
      "The function vectorized the stories,questions and answers into padded sequences. A loop runs through every story,query and answer and the raw words are converted into a word index. Each set of story, query and answer is appended to their output list. The aforementioned words are tokenized to integers and the sequence is padded so that each list is of equal length. This is in the form of a tuple.",
      "We can see how the input data from the test is vectorized by calling the function.",
      "Step 5: Creating the model",
      "We used Python  Keras Sequential model which is a linear stack of models. Encoder is a stack of recurrent units in which each element takes a single element of the input sequence, gathers information and passes it forward (encoder vector). In the facebook bAbI question- answering , the input sequence is a word in the question. The inputs get embedded into a sequence of vectors. Encoder vector encapsulates the information from input elements so that the decoder can make accurate predictions. It’s a hidden state of the decoder part of the model. Decoder is a stack of recurrent units in which each predicts an output at a time step t. Read more about the model here.",
      "This function will take input data that contains stories, queries and answers, a word_index which is a dictionary of words and assigns integers, maximum length of story and longest question as parameters. The function vectorized the stories,questions and answers into padded sequences. A loop runs through every story,query and answer and the raw words are converted into a word index. Each set of story, query and answer is appended to their output list. The aforementioned words are tokenized to integers and the sequence is padded so that each list is of equal length. This is in the form of a tuple. We can see how the input data from the test is vectorized by calling the function. Step 5: Creating the model We used Python  Keras Sequential model which is a linear stack of models. Encoder is a stack of recurrent units in which each element takes a single element of the input sequence, gathers information and passes it forward (encoder vector). In the facebook bAbI question- answering , the input sequence is a word in the question. The inputs get embedded into a sequence of vectors. Encoder vector encapsulates the information from input elements so that the decoder can make accurate predictions. It’s a hidden state of the decoder part of the model. Decoder is a stack of recurrent units in which each predicts an output at a time step t. Read more about the model here."
    ]
  },
  "bookmarks": {
    "https://github.com/ai-forever/mgpt": "ai-forever/mgpt: Multilingual Generative Pretrained Model",
    "https://github.com/legacyai/tf-transformers": "legacyai/tf-transformers: State of the art faster Transformer with Tensorflow 2.0 ( NLP, Computer Vision, Audio ).",
    "https://www.viinyx.com": "Viinyx AI - The Best All-in-one AI browser assistant",
    "https://www.saasradius.com/categories": "SaaS Radius - Categories",
    "https://www.saashub.com/categories": "Top Categories - SaaSHub",
    "https://github.com/yumingj/DeepFashion-MultiModal": "yumingj/DeepFashion-MultiModal: A large-scale high-quality human dataset with rich multi-modal annotations",
    "https://github.com/maxmoundas/NanoGPT": "maxmoundas/NanoGPT: Character-level GPT model that can easily be trained on any .txt dataset",
    "https://github.com/cthiriet/femtoGPT/tree/main": "cthiriet/femtoGPT: a GPT in pure Python",
    "https://github.com/dleemiller/WordLlama/blob/main/wordllama/embedding/word_llama_embedding.py": "WordLlama/wordllama/embedding/word_llama_embedding.py at main · dleemiller/WordLlama",
    "https://github.com/diixo/vectorEmbeddings/blob/main/vector_embedding.py": "Provides a class for working with text embeddings and searching for matches in a Question-Answer database.",
    "https://jarrentwu1031.github.io/SingleInsert-web": "SingleInsert:\nInserting New Concepts from a Single Image into Text-to-Image Models for Flexible Editing",
    "https://github.com/jinlinyi/PerspectiveFields": "jinlinyi/PerspectiveFields: [CVPR 2023 Highlight] Perspective Fields for Single Image Camera Calibration",
    "https://habr.com/ru/articles/823568": "Он победил LLM RAG: реализуем BM25+ с самых азов / Хабр",
    "https://paperswithcode.com/datasets?q=bAbi&mod=texts": "Machine Learning Datasets | Papers With Code",
    "https://blog.vespa.ai/announcing-long-context-colbert-in-vespa": "Announcing Vespa Long-Context ColBERT | Vespa Blog",
    "https://arxiv.org/abs/2201.11903": "[2201.11903] Chain-of-Thought Prompting Elicits Reasoning in Large Language Models",
    "https://github.com/neevaco/FasterTransformer/blob/corvo/examples/cpp/gpt/gpt_example.cc": "FasterTransformer/examples/cpp/gpt/gpt_example.cc at corvo · neevaco/FasterTransformer",
    "https://www.kaggle.com/code/lonnieqin/babi-tasks-question-answering-with-keras": "Babi Tasks Question Answering with Keras",
    "https://www.kaggle.com/datasets/roblexnana/the-babi-tasks-for-nlp-qa-system": "The bAbI tasks data",
    "https://www.kaggle.com/code/smidgin/character-level-nanogpt": "Character-level nanoGPT",
    "https://cs229.stanford.edu/proj2015/333_report.pdf": "Solving the Prerequisites: Improving Question Answering on the bAbI Dataset",
    "https://women-in-ai-ireland.github.io/August-2020-WaiLEARN-QA-Chatbot": "This project describes a QA Chatbot built using the Facebook Babi Dataset. | WaiPRACTICE"
  }
}